[
  {
    "idx": 1,
    "director": ["Christopher Nolan"],
    "writer": ["Christopher Nolan"],
    "name": "Inception",
    "year": "2010",
    "time": "2h 28m",
    "image": "https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/p7825626_p_v8_af.jpg",
    "score": 9.3,
    "plot": "Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state. His rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. One last job could give him his life back, but only if he can accomplish the impossible—inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea, but to plant one. If they succeed, it could be the perfect crime.",
    "categories": ["Sci-Fi", "Thriller"],
    "videoexamplelink": "https://www.youtube.com/embed/YoHD9XEInc0?si=6heBHPV-30CgdZXu",
    "actors": ["Leonardo DiCaprio", "Joseph Gordon-Levitt", "Elliot Page"]
  },
  {
    "idx": 2,
    "director": ["Christopher Nolan"],
    "writer": ["Christopher Nolan", "Jonathan Nolan"],
    "name": "The Dark Knight",
    "year": "2008",
    "time": "2h 32m",
    "image": "https://m.media-amazon.com/images/I/81CLFQwU-WL.jpg",
    "score": 9.0,
    "plot": "Batman raises the stakes in his war on crime. With the help of Lieutenant Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the city streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker. The Joker, whose eerie grin and laughter characterize his emotional instability, becomes an anarchist force of chaos and an escalating criminal mastermind.",
    "categories": ["Action", "Crime"],
    "videoexamplelink": "https://www.youtube.com/embed/EXeTwQWrcwY?si=JXe8UaMS8FGRxbRY",
    "actors": ["Christian Bale", "Heath Ledger", "Aaron Eckhart"]
  },
  {
    "idx": 3,
    "director": ["Christopher Nolan"],
    "writer": ["Jonathan Nolan", "Christopher Nolan"],
    "name": "Interstellar",
    "year": "2014",
    "time": "2h 49m",
    "image": "https://m.media-amazon.com/images/I/81v1NMJBrlL._AC_UF894,1000_QL80_.jpg",
    "score": 8.6,
    "plot": "In Earth's future, a global crop blight and second Dust Bowl are slowly rendering the planet uninhabitable. Professor Brand, a brilliant NASA physicist, is working on plans to save mankind by transporting Earth's population to a new home via a wormhole. But first, Brand must send former NASA pilot Cooper and a team of researchers through the wormhole and across the galaxy to find out which of three planets could be mankind's new home.",
    "categories": ["Sci-Fi", "Adventure"],
    "videoexamplelink": "https://www.youtube.com/embed/zSWdZVtXT7E?si=1RFpOnmwmMsuGL89",
    "actors": ["Matthew McConaughey", "Anne Hathaway", "Jessica Chastain"]
  },
  {
    "idx": 4,
    "director": ["James Cameron"],
    "writer": ["James Cameron"],
    "name": "Avatar",
    "year": "2009",
    "time": "2h 42m",
    "image": "https://m.media-amazon.com/images/I/41kTVLeW1CL._AC_UF894,1000_QL80_.jpg",
    "score": 7.8,
    "plot": "In the mid-22nd century, humans are colonizing Pandora, a lush, habitable moon of a gas giant in the Alpha Centauri star system. The expansion of the mining colony threatens the indigenous Na'vi—a humanoid species with their own language and culture. When paraplegic Marine Jake Sully is dispatched to Pandora on a unique mission and becomes torn between following orders and protecting the world he feels is his home.",
    "categories": ["Sci-Fi", "Fantasy"],
    "videoexamplelink": "https://www.youtube.com/embed/5PSNL1qE6VY?si=mGrUYijv_HpfWzWB",
    "actors": ["Sam Worthington", "Zoe Saldana", "Sigourney Weaver"]
  },
  {
    "idx": 5,
    "director": ["Frank Darabont"],
    "writer": ["Stephen King", "Frank Darabont"],
    "name": "The Shawshank Redemption",
    "year": "1994",
    "time": "2h 22m",
    "image": "https://m.media-amazon.com/images/I/71715eBi1sL._AC_SL1000_.jpg",
    "score": 9.3,
    "plot": "Two imprisoned men, Andy Dufresne and Ellis Boyd 'Red' Redding, bond over several years, finding solace and eventual redemption through acts of common decency. Andy is serving a life sentence for the murder of his wife, but maintains his innocence. Red, the prison contraband smuggler who can get anything for a price, becomes Andy's close friend and mentor, helping him adapt to prison life.",
    "categories": ["Drama", "Crime"],
    "videoexamplelink": "https://www.youtube.com/embed/6hB3S9bIaco?si=Lsfnhnb0bt5WAK6S",
    "actors": ["Tim Robbins", "Morgan Freeman", "Bob Gunton"]
  },
  {
    "idx": 6,
    "director": ["Lana Wachowski", "Lilly Wachowski"],
    "writer": ["Lilly Wachowski", "Lana Wachowski"],
    "name": "The Matrix",
    "year": "1999",
    "time": "2h 16m",
    "image": "https://m.media-amazon.com/images/M/MV5BNzQzOTk3OTAtNDQ0Zi00ZTVkLWI0MTEtMDllZjNkYzNjNTc4L2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
    "score": 8.7,
    "plot": "In a dystopian future, computer hacker Neo learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers. Neo joins rebel warriors Morpheus and Trinity in their struggle against the machines that have enslaved humanity in a simulated reality. As Neo becomes more adept at his craft, he must confront increasingly difficult choices that will impact the fate of the world and the future of humanity.",
    "categories": ["Sci-Fi", "Action"],
    "videoexamplelink": "https://www.youtube.com/embed/m8e-FF8MsqU?si=9ERMYJ2ZGcGksgbc",
    "actors": ["Keanu Reeves", "Laurence Fishburne", "Carrie-Anne Moss"]
  }          
]
